chipKIT32/chipKIT-core/pic32/boards.txt
menu.USB=USB Devices
menu.MCU=MCU
menu.Frequency=Core Frequency
menu.Version=Version
menu.PMOD=PMOD Shield

# cmod

cmod.name=chipKIT Cmod
cmod.group=chipKIT

# new items
cmod.platform=pic32
cmod.build.board=_BOARD_CMOD_
cmod.ldscript=chipKIT-application-32MX150F128.ld
# Use this -G1024 option ONLY for boards with 64K RAM or less
cmod.compiler.c.extra_flags=-G1024
cmod.compiler.cpp.extra_flags=-G1024
# end of new items

cmod.upload.protocol=stk500v2
# 128KB - 4K for EEPROM
cmod.upload.maximum_size=126976
cmod.upload.maximum_data_size=32768
cmod.upload.speed=115200
cmod.upload.tool=pic32prog

cmod.build.mcu=32MX150F128D
cmod.build.f_cpu=40000000L
cmod.build.core=pic32
cmod.build.variant=Cmod
cmod.build.ldscript.path={build.variant.path}

# HelvePic 

HelvePic.name=HelvePic
HelvePic.group=chipKIT
HelvePic.platform=pic32
HelvePic.build.board=_BOARD_HELVEPIC32BBS_

HelvePic.usb.enabled=true
HelvePic.usb.default=a_cdcacm

HelvePic.ccflags=-Map="map.map"
HelvePic.ldscript=chipKIT-application-32MX250F128.ld
# Use this -G1024 option ONLY for boards with 64K RAM or less
HelvePic.compiler.c.extra_flags=-G1024
HelvePic.compiler.cpp.extra_flags=-G1024
# end of new items

HelvePic.upload.protocol=stk500v2
# 128KB - 4K for EEPROM - 4K for bootloader
HelvePic.upload.maximum_size=122880
HelvePic.upload.maximum_data_size=32768
HelvePic.upload.speed=115200
HelvePic.upload.tool=pic32prog

HelvePic.build.mcu=32MX250F128B
HelvePic.build.f_cpu=48000000L
HelvePic.build.core=pic32
HelvePic.build.variant=HelvePicBBside

HelvePic.menu.Frequency.48=48MHz
HelvePic.menu.Frequency.build.f_cpu=48000000L
HelvePic.menu.Frequency.40=40MHz
HelvePic.menu.Frequency.build.f_cpu=40000000L

HelvePic.menu.Version.PTH=HelvePic32
HelvePic.menu.Version.PTH.build.board=_BOARD_HELVEPIC32_
HelvePic.menu.Version.PTH.build.variant=HelvePic32
HelvePic.menu.Version.PTH.build.mcu=32MX250F128B
HelvePic.menu.Version.PTH.ldscript=chipKIT-application-32MX250F128.ld
HelvePic.menu.Version.PTH.upload.maximum_size=122880
HelvePic.menu.Version.PTH.upload.maximum_data_size=32768

HelvePic.menu.Version.PTH27=HelvePic32 MX270
HelvePic.menu.Version.PTH27.build.board=_BOARD_HELVEPIC32A_
HelvePic.menu.Version.PTH27.build.variant=HelvePic32a
HelvePic.menu.Version.PTH27.build.mcu=32MX270F256B
HelvePic.menu.Version.PTH27.ldscript=chipKIT-application-32MX270F256.ld
HelvePic.menu.Version.PTH27.upload.maximum_size=249856
HelvePic.menu.Version.PTH27.upload.maximum_data_size=63488

HelvePic.menu.Version.SMD=HelvePic32 SMD
HelvePic.menu.Version.SMD.build.board=_BOARD_HELVEPIC32_SMD_
HelvePic.menu.Version.SMD.build.variant=HelvePic32SMD
HelvePic.menu.Version.SMD.build.mcu=32MX250F128D
HelvePic.menu.Version.SMD.ldscript=chipKIT-application-32MX250F128.ld
HelvePic.menu.Version.SMD.upload.maximum_size=122880
HelvePic.menu.Version.SMD.upload.maximum_data_size=32768

HelvePic.menu.Version.SMD27=HelvePic32 SMD MX270
HelvePic.menu.Version.SMD27.build.board=_BOARD_HELVEPIC32_SMDA_
HelvePic.menu.Version.SMD27.build.variant=HelvePic32SMDa
HelvePic.menu.Version.SMD27.build.mcu=32MX270F256D
HelvePic.menu.Version.SMD27.ldscript=chipKIT-application-32MX270F256.ld
HelvePic.menu.Version.SMD27.upload.maximum_size=249856
HelvePic.menu.Version.SMD27.upload.maximum_data_size=63488

HelvePic.menu.Version.Robot=HelvePic32 Robot
HelvePic.menu.Version.Robot.build.board=_BOARD_HELVEPIC32_SMDA_
HelvePic.menu.Version.Robot.build.variant=HelveKIT32robot
HelvePic.menu.Version.Robot.build.mcu=32MX270F256D
HelvePic.menu.Version.Robot.ldscript=chipKIT-application-32MX270F256.ld
HelvePic.menu.Version.Robot.upload.maximum_size=249856
HelvePic.menu.Version.Robot.upload.maximum_data_size=63488

HelvePic.menu.Version.BBS=HelvePic32 BreadBoardSide
HelvePic.menu.Version.BBS.build.board=_BOARD_HELVEPIC32BBS_
HelvePic.menu.Version.BBS.build.variant=HelvePic32BBside
HelvePic.menu.Version.BBS.build.mcu=32MX250F128B
HelvePic.menu.Version.BBS.ldscript=chipKIT-application-32MX250F128.ld
HelvePic.menu.Version.BBS.upload.maximum_size=122880
HelvePic.menu.Version.BBS.upload.maximum_data_size=32768

# DP32

chipkit_DP32.name=chipKIT DP32
chipkit_DP32.group=chipKIT

# new items
chipkit_DP32.platform=pic32
chipkit_DP32.build.board=_BOARD_DP32_

chipkit_DP32.usb.enabled=true
chipkit_DP32.usb.default=a_cdcacm

chipkit_DP32.ccflags=-Map="map.map"
chipkit_DP32.ldscript=chipKIT-application-32MX250F128.ld
# Use this -G1024 option ONLY for boards with 64K RAM or less
chipkit_DP32.compiler.c.extra_flags=-G1024
chipkit_DP32.compiler.cpp.extra_flags=-G1024
# end of new items

chipkit_DP32.upload.protocol=stk500v2
# 128KB - 4K for EEPROM - 4K for bootloader
chipkit_DP32.upload.maximum_size=122880
chipkit_DP32.upload.maximum_data_size=32768
chipkit_DP32.upload.speed=115200
chipkit_DP32.upload.tool=pic32prog

chipkit_DP32.build.mcu=32MX250F128B
chipkit_DP32.build.f_cpu=40000000L
chipkit_DP32.build.core=pic32
chipkit_DP32.build.variant=DP32

# Lenny

lenny.name=chipKIT Lenny
lenny.group=chipKIT
lenny.platform=pic32
lenny.build.board=_BOARD_LENNY_
lenny.ccflags=-Map="map.map"
lenny.ldscript=chipKIT-application-32MX270F256.ld

lenny.usb.enabled=true
lenny.usb.default=b_cdcacm_km

# Use this -G1024 option ONLY for boards with 64K RAM or less
lenny.compiler.c.extra_flags=-G1024
lenny.compiler.cpp.extra_flags=-G1024
lenny.upload.protocol=stk500v2

# 128KB - 4K for EEPROM - 4K for bootloader
# Not a perfect number, but closer than the tiny amount there before...
lenny.upload.maximum_size=249856
lenny.upload.speed=115200
lenny.upload.tool=pic32prog

lenny.build.mcu=32MX270F256D
lenny.build.f_cpu=40000000L
lenny.build.core=pic32
lenny.build.variant=Lenny

# Mega (MAX32)

mega_pic32.name=chipKIT MAX32
mega_pic32.group=chipKIT

# new items
mega_pic32.platform=pic32
mega_pic32.build.board=_BOARD_MEGA_
mega_pic32.ldscript=chipKIT-application-32MX795F512.ld
# end of new items

mega_pic32.upload.protocol=stk500v2
mega_pic32.upload.maximum_size=520192
mega_pic32.upload.maximum_data_size=131072
mega_pic32.upload.speed=115200
mega_pic32.upload.tool=pic32prog

mega_pic32.build.mcu=32MX795F512L
mega_pic32.build.f_cpu=80000000L
mega_pic32.build.core=pic32
mega_pic32.build.variant=Max32

mega_pic32.usb.enabled=true
mega_pic32.usb.default=z_custom

# MX3 

chipkit_mx3.name=chipKIT MX3
chipkit_mx3.group=chipKIT

