chipKIT32/chipKIT-core/pic32/boards.txt
flipnclickmz.build.mcu=32MZ2048EFH100
flipnclickmz.build.f_cpu=252000000L
flipnclickmz.build.core=pic32
flipnclickmz.build.variant=FlipNClick_MZ
flipnclickmz.build.ldscript.path={build.variant.path}

# openBCI

openbci.name=OpenBCI 32
openbci.group=chipKIT

# new items
openbci.platform=pic32
openbci.build.board=_BOARD_DP32_

openbci.usb.enabled=false
openbci.usb.default=z_custom

openbci.ccflags=-Map="map.map"
openbci.ldscript=chipKIT-application-32MX250F128.ld
# Use this -G1024 option ONLY for boards with 64K RAM or less
openbci.compiler.c.extra_flags=-G1024
openbci.compiler.cpp.extra_flags=-G1024
# end of new items

openbci.upload.protocol=stk500v2
# 128KB - 4K for EEPROM - 4K for bootloader
openbci.upload.maximum_size=122880
openbci.upload.maximum_data_size=32768
openbci.upload.speed=115200
openbci.upload.tool=pic32prog

openbci.build.mcu=32MX250F128B
openbci.build.f_cpu=40000000L
openbci.build.core=pic32
openbci.build.variant=openbci

# OpenScope

OpenScope.name=OpenScope
OpenScope.group=chipKIT

# new items
OpenScope.platform=pic32
OpenScope.build.board=_BOARD_OPENSCOPE_
OpenScope.ldscript=OpenScope.ld
# end of new items

OpenScope.upload.protocol=stk500v2
OpenScope.upload.maximum_size=2031616
OpenScope.upload.maximum_data_size=524288
OpenScope.upload.speed=115200

OpenScope.build.mcu=32MZ2048EFG124
OpenScope.build.f_cpu=200000000UL
OpenScope.build.core=pic32
OpenScope.ldcommon=chipKIT-application-COMMON-MZ.ld
OpenScope.build.variant=OpenScope
OpenScope.build.ldscript.path={build.variant.path}
#OpenScope.upload.using=avrdude1
OpenScope.upload.tool=pic32prog
#OpenScope.upload.tool=avrdude

OpenScope.usb.enabled=true
OpenScope.usb.default=a_cdcacm

# cui32

cui32.name=Pic32 CUI32-Development Stick
cui32.group=CUI32

# new items
cui32.platform=pic32
cui32.build.board=_BOARD_CUI32_

cui32.usb.enabled=true
cui32.usb.default=a_cdcacm

cui32.ldscript=chipKIT-application-32MX440F512.ld
# Use this -G1024 option ONLY for boards with 64K RAM or less
cui32.compiler.c.extra_flags=-G1024
cui32.compiler.cpp.extra_flags=-G1024
# end of new items

cui32.upload.protocol=stk500v2
cui32.upload.maximum_size=520192
cui32.upload.maximum_data_size=32768
cui32.upload.speed=115200
cui32.upload.tool=pic32prog

cui32.build.mcu=32MX440F512H
cui32.build.f_cpu=80000000L
cui32.build.core=pic32
cui32.build.variant=CUI32

# Penguino32

Olimex_Pinguino32.name=PIC32 Pinguino
Olimex_Pinguino32.group=Olimex

Olimex_Pinguino32.platform=pic32
Olimex_Pinguino32.build.board=_BOARD_OLIMEX_PIC32_PINGUINO_
Olimex_Pinguino32.ldscript=chipKIT-application-32MX440F256.ld

Olimex_Pinguino32.usb.enabled=true
Olimex_Pinguino32.usb.default=a_cdcacm

Olimex_Pinguino32.upload.protocol=stk500v2
Olimex_Pinguino32.upload.maximum_size=258048
Olimex_Pinguino32.upload.maximum_data_size=32768
Olimex_Pinguino32.upload.speed=115200
Olimex_Pinguino32.upload.tool=pic32prog

# Use this -G1024 option ONLY for boards with 64K RAM or less
Olimex_Pinguino32.compiler.c.extra_flags=-G1024
Olimex_Pinguino32.compiler.cpp.extra_flags=-G1024

Olimex_Pinguino32.build.mcu=32MX440F256H
Olimex_Pinguino32.build.f_cpu=80000000L
Olimex_Pinguino32.build.core=pic32
Olimex_Pinguino32.build.variant=Olimex_PIC32_Pinguino

# UBW32 MX460

ubw32_mx460.name=Pic32 UBW32-MX460
ubw32_mx460.group=UBW32

# new items
ubw32_mx460.platform=pic32
ubw32_mx460.build.board=_BOARD_UBW32_MX460_
ubw32_mx460.ldscript=chipKIT-application-32MX460F512.ld
# Use this -G1024 option ONLY for boards with 64K RAM or less
ubw32_mx460.compiler.c.extra_flags=-G1024
ubw32_mx460.compiler.cpp.extra_flags=-G1024
# end of new items

ubw32_mx460.usb.enabled=true
ubw32_mx460.usb.default=a_cdcacm

ubw32_mx460.upload.protocol=stk500v2
ubw32_mx460.upload.maximum_size=520192
ubw32_mx460.upload.maximum_data_size=32768
ubw32_mx460.upload.speed=115200
ubw32_mx460.upload.tool=pic32prog

ubw32_mx460.build.mcu=32MX460F512L
ubw32_mx460.build.f_cpu=80000000L
ubw32_mx460.build.core=pic32
ubw32_mx460.build.variant=UBW_MX4

# UBW32 MX795

ubw32_mx795.name=Pic32 UBW32-MX795
ubw32_mx795.group=UBW32

# new items
ubw32_mx795.platform=pic32
ubw32_mx795.build.board=_BOARD_UBW32_MX795_
ubw32_mx795.ldscript=chipKIT-application-32MX795F512.ld
# end of new items

ubw32_mx795.usb.enabled=true
ubw32_mx795.usb.default=a_cdcacm

ubw32_mx795.upload.protocol=stk500v2
ubw32_mx795.upload.maximum_size=520192
ubw32_mx795.upload.maximum_data_size=131072
ubw32_mx795.upload.speed=115200
ubw32_mx795.upload.tool=pic32prog

ubw32_mx795.build.mcu=32MX795F512L
ubw32_mx795.build.f_cpu=80000000L
ubw32_mx795.build.core=pic32
ubw32_mx795.build.variant=UBW_MX7

# picadillo 35t

picadillo_35t.name=Picadillo 35T
picadillo_35t.group=4D Systems
picadillo_35t.platform=pic32
picadillo_35t.build.board=_BOARD_PICADILLO_35T_
picadillo_35t.ldscript=chipKIT-application-32MX795F512.ld

picadillo_35t.variant=picadillo_35t
picadillo_35t.description=PICadillo-35T
picadillo_35t.bootloader=bootloader.hex
picadillo_35t.upload.protocol=stk500v2
picadillo_35t.upload.maximum_size=520192
picadillo_35t.upload.maximum_data_size=131072
picadillo_35t.upload.speed=115200
picadillo_35t.upload.tool=pic32prog

picadillo_35t.build.mcu=32MX795F512L
picadillo_35t.build.f_cpu=80000000L
picadillo_35t.build.core=pic32
picadillo_35t.build.variant=picadillo_35t

picadillo_35t.usb.enabled=true
picadillo_35t.usb.default=z_custom

# Pontech NoFire

pontech_NoFire.name=PONTECH NoFire
pontech_NoFire.group=PONTECH

pontech_NoFire.usb.enabled=true
pontech_NoFire.usb.default=a_cdcacm

# new items
pontech_NoFire.platform=pic32
pontech_NoFire.build.board=_BOARD_PONTECH_NOFIRE_
pontech_NoFire.ldscript=MZ-application-32MZ2048ECX.ld
# end of new items

pontech_NoFire.upload.protocol=stk500v2
pontech_NoFire.upload.maximum_size=2080768
pontech_NoFire.upload.maximum_data_size=524288
pontech_NoFire.upload.speed=115200
pontech_NoFire.upload.tool=pic32prog

pontech_NoFire.build.mcu=32MZ2048EFG100
pontech_NoFire.build.f_cpu=200000000UL
pontech_NoFire.build.core=pic32
pontech_NoFire.ldcommon=chipKIT-application-COMMON-MZ.ld
pontech_NoFire.build.variant=PONTECH_NoFire
pontech_NoFire.build.ldscript.path={build.variant.path}

# quick240 USB

quick240_usb_pic32.name=PONTECH Quick240
quick240_usb_pic32.group=PONTECH

