chipKIT32/chipKIT-core/pic32/boards.txt
# new items
quick240_usb_pic32.platform=pic32
quick240_usb_pic32.build.board=_BOARD_PONTECH_QUICK240_USB_
quick240_usb_pic32.ldscript=chipKIT-application-32MX795F512.ld
# end of new items

quick240_usb_pic32.usb.enabled=true
quick240_usb_pic32.usb.default=a_cdcacm

quick240_usb_pic32.upload.protocol=stk500v2
quick240_usb_pic32.upload.maximum_size=520192
quick240_usb_pic32.upload.maximum_data_size=131072
quick240_usb_pic32.upload.speed=115200
quick240_usb_pic32.upload.tool=pic32prog

quick240_usb_pic32.build.mcu=32MX795F512L
quick240_usb_pic32.build.f_cpu=80000000L
quick240_usb_pic32.build.core=pic32
quick240_usb_pic32.build.variant=PONTECH_Quick240

# Pontech UAV100

usbono_pic32.name=PONTECH UAV100
usbono_pic32.group=PONTECH

# new items
usbono_pic32.platform=pic32
usbono_pic32.build.board=_BOARD_PONTECH_UAV100_

usbono_pic32.usb.enabled=true
usbono_pic32.usb.default=a_cdcacm

usbono_pic32.ldscript=chipKIT-application-32MX440F512.ld
# Use this -G1024 option ONLY for boards with 64K RAM or less
usbono_pic32.compiler.c.extra_flags=-G1024
usbono_pic32.compiler.cpp.extra_flags=-G1024
#chipKIT-UNO32-application-32MX320F128L.ld
# end of new items

usbono_pic32.upload.protocol=stk500v2
usbono_pic32.upload.maximum_size=520192
usbono_pic32.upload.maximum_data_size=32768
usbono_pic32.upload.speed=115200
usbono_pic32.upload.tool=pic32prog

usbono_pic32.build.mcu=32MX440F512H
usbono_pic32.build.f_cpu=80000000L
usbono_pic32.build.core=pic32
usbono_pic32.build.variant=PONTECH_UAV100
#usbono_pic32.build.variant=Uno32

# dsmini 

dsmini.name=DataStation Mini
dsmini.group=Makerology
dsmini.platform=pic32
dsmini.build.board=_BOARD_DSMINI_
dsmini.ccflags=-Map="map.map"
dsmini.ldscript=chipKIT-application-32MX150F128.ld
dsmini.build.ldscript.path={build.variant.path}

dsmini.usb.enabled=false

# Use this -G1024 option ONLY for boards with 64K RAM or less
dsmini.compiler.c.extra_flags=-G1024
dsmini.compiler.cpp.extra_flags=-G1024
dsmini.upload.protocol=stk500v2

# 128KB - 4K for EEPROM - 4K for bootloader
dsmini.upload.maximum_size=122880
dsmini.upload.speed=115200
dsmini.upload.tool=pic32prog

dsmini.build.mcu=32MX150F128C
dsmini.build.f_cpu=40000000L
dsmini.build.core=pic32
dsmini.build.variant=DSMini

# RGB Station

RGB_Station.name=RGB Station
RGB_Station.group=chipKIT

RGB_Station.platform=pic32
RGB_Station.build.board=_BOARD_RGB_STATION_

RGB_Station.usb.enabled=true
RGB_Station.usb.default=a_cdcacm

RGB_Station.ccflags=-Map="map.map"
RGB_Station.ldscript=chipKIT-application-32MX270F256_BLEBootloader.ld
# Use this -G1024 option ONLY for boards with 64K RAM or less
RGB_Station.compiler.c.extra_flags=-G1024
RGB_Station.compiler.cpp.extra_flags=-G1024
RGB_Station.build.ldscript.path={build.variant.path}

RGB_Station.upload.protocol=stk500v2
# 256KB (0x40000) - 4K (0x1000) for exception vectors - 4K (0x1000) for EEPROM - 12K (0x3000) for bootloader = (245760) 0x3B000
# This number isn't exactly correct yet - you can't get to 100% without problems. But it's close.
RGB_Station.upload.maximum_size=245760
# 64KB (0x10000) - 2048 (0x800) for stack - 344 (0x158) for something else = 63488 (0xF800)
# This number isn't exactly correct yet - you can't get to 100% without problems. But it's close.
RGB_Station.upload.maximum_data_size=63488
RGB_Station.upload.speed=115200
RGB_Station.upload.tool=pic32prog

RGB_Station.build.mcu=32MX270F256D
RGB_Station.build.f_cpu=48000000L
RGB_Station.build.core=pic32
RGB_Station.build.variant=RGB_Station

RGB_Station.menu.Frequency.48=48MHz
RGB_Station.menu.Frequency.build.f_cpu=48000000L



ck-pro-mz.name=chipKIT Pro MZ
ck-pro-mz.group=chipKIT
ck-pro-mz.platform=pic32
ck-pro-mz.build.board=_BOARD_CHIPKIT_PRO_MZ_
ck-pro-mz.ldscript=MZ-application-32MZ2048EFG.ld
ck-pro-mz.upload.protocol=an1388
ck-pro-mz.upload.maximum_size=2080768
ck-pro-mz.upload.maximum_data_size=524288
ck-pro-mz.upload.speed=115200
ck-pro-mz.upload.tool=pic32prog-hid
ck-pro-mz.build.mcu=32MZ2048EFG064
ck-pro-mz.build.f_cpu=200000000UL
ck-pro-mz.build.core=pic32
ck-pro-mz.ldcommon=chipKIT-application-COMMON-MZ.ld
ck-pro-mz.build.variant=ck-pro-mz
ck-pro-mz.build.ldscript.path={build.variant.path}
ck-pro-mz.usb.enabled=true
ck-pro-mz.usb.default=a_cdcacm
ck-pro-mz.usb.vid=04d8
ck-pro-mz.usb.pid=0f5f
ck-pro-mz.usb.protocol=an1388

ck-mz-lite.name=chipKIT MZ Lite
ck-mz-lite.group=chipKIT
ck-mz-lite.platform=pic32
ck-mz-lite.build.board=_BOARD_CHIPKIT_MZ_LITE_
ck-mz-lite.ldscript=MZ-application-32MZ0512EFE.ld
ck-mz-lite.upload.protocol=an1388
ck-mz-lite.upload.maximum_size=524288
ck-mz-lite.upload.maximum_data_size=131072
ck-mz-lite.upload.speed=115200
ck-mz-lite.upload.tool=pic32prog-hid
ck-mz-lite.build.mcu=32MZ0512EFE064
ck-mz-lite.build.f_cpu=200000000UL
ck-mz-lite.build.core=pic32
ck-mz-lite.ldcommon=chipKIT-application-COMMON-MZ.ld
ck-mz-lite.build.variant=ck-mz-lite
ck-mz-lite.build.ldscript.path={build.variant.path}
ck-mz-lite.usb.enabled=true
ck-mz-lite.usb.default=a_cdcacm
ck-mz-lite.usb.vid=04d8
ck-mz-lite.usb.pid=0f5f
ck-mz-lite.usb.protocol=an1388


gamma.name=Project Gamma
gamma.group=Majenko Technologies
gamma.platform=pic32
gamma.build.board=_BOARD_MAJENKO_GAMMA_
gamma.ldscript=MZ-application-32MZ2048EFG.ld
gamma.upload.protocol=stk500v2
gamma.upload.maximum_size=2080768
gamma.upload.maximum_data_size=524288
gamma.upload.speed=115200
gamma.upload.tool=pic32prog
gamma.build.mcu=32MZ2048EFG100
gamma.build.f_cpu=200000000UL
gamma.build.core=pic32
gamma.ldcommon=chipKIT-application-COMMON-MZ.ld
gamma.build.variant=gamma
gamma.build.ldscript.path={build.variant.path}
gamma.usb.enabled=true
gamma.usb.default=z_custom




############# Auto generated menu entries below here. ###############
############### DO NOT ADD ANYTHING AFTER THIS LINE #################

ubw32_mx795.menu.USB.a_cdcacm=Serial
ubw32_mx795.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
ubw32_mx795.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
ubw32_mx795.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
ubw32_mx795.menu.USB.z_custom=Custom / Disabled
ubw32_mx795.menu.USB.z_custom.build.extra_flags=

clicker2.menu.USB.a_cdcacm=Serial
clicker2.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
clicker2.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
clicker2.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
clicker2.menu.USB.z_custom=Custom / Disabled
clicker2.menu.USB.z_custom.build.extra_flags=

picadillo_35t.menu.USB.z_custom=Custom / Disabled
picadillo_35t.menu.USB.z_custom.build.extra_flags=
picadillo_35t.menu.USB.a_cdcacm=Serial
picadillo_35t.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
picadillo_35t.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
picadillo_35t.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

OpenScope.menu.USB.a_cdcacm=Serial
OpenScope.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
OpenScope.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
OpenScope.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
OpenScope.menu.USB.z_custom=Custom / Disabled
OpenScope.menu.USB.z_custom.build.extra_flags=

ubw32_mx460.menu.USB.a_cdcacm=Serial
ubw32_mx460.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
ubw32_mx460.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
ubw32_mx460.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
ubw32_mx460.menu.USB.z_custom=Custom / Disabled
ubw32_mx460.menu.USB.z_custom.build.extra_flags=

chipkit_pro_mx7.menu.USB.z_custom=Custom / Disabled
chipkit_pro_mx7.menu.USB.z_custom.build.extra_flags=
chipkit_pro_mx7.menu.USB.a_cdcacm=Serial
chipkit_pro_mx7.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
chipkit_pro_mx7.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
chipkit_pro_mx7.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

usbono_pic32.menu.USB.a_cdcacm=Serial
usbono_pic32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
usbono_pic32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
usbono_pic32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
usbono_pic32.menu.USB.z_custom=Custom / Disabled
usbono_pic32.menu.USB.z_custom.build.extra_flags=

RGB_Station.menu.USB.a_cdcacm=Serial
RGB_Station.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
RGB_Station.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
RGB_Station.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
RGB_Station.menu.USB.z_custom=Custom / Disabled
RGB_Station.menu.USB.z_custom.build.extra_flags=

ck-mz-lite.menu.USB.a_cdcacm=Serial
ck-mz-lite.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
ck-mz-lite.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
ck-mz-lite.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
ck-mz-lite.menu.USB.z_custom=Custom / Disabled
ck-mz-lite.menu.USB.z_custom.build.extra_flags=

cui32.menu.USB.a_cdcacm=Serial
cui32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
cui32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
cui32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
cui32.menu.USB.z_custom=Custom / Disabled
cui32.menu.USB.z_custom.build.extra_flags=

