chipKIT32/chipKIT-core/pic32/boards.txt
CUI32stem.menu.USB.a_cdcacm=Serial
CUI32stem.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
CUI32stem.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
CUI32stem.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
CUI32stem.menu.USB.z_custom=Custom / Disabled
CUI32stem.menu.USB.z_custom.build.extra_flags=

gamma.menu.USB.z_custom=Custom / Disabled
gamma.menu.USB.z_custom.build.extra_flags=
gamma.menu.USB.a_cdcacm=Serial
gamma.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
gamma.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
gamma.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

chipkit_WiFire.menu.USB.z_custom=Custom / Disabled
chipkit_WiFire.menu.USB.z_custom.build.extra_flags=
chipkit_WiFire.menu.USB.a_cdcacm=Serial
chipkit_WiFire.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
chipkit_WiFire.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
chipkit_WiFire.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

HelvePic.menu.USB.a_cdcacm=Serial
HelvePic.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
HelvePic.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
HelvePic.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
HelvePic.menu.USB.z_custom=Custom / Disabled
HelvePic.menu.USB.z_custom.build.extra_flags=

chipkit_WF32.menu.USB.z_custom=Custom / Disabled
chipkit_WF32.menu.USB.z_custom.build.extra_flags=
chipkit_WF32.menu.USB.a_cdcacm=Serial
chipkit_WF32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
chipkit_WF32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
chipkit_WF32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

pontech_NoFire.menu.USB.a_cdcacm=Serial
pontech_NoFire.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
pontech_NoFire.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
pontech_NoFire.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
pontech_NoFire.menu.USB.z_custom=Custom / Disabled
pontech_NoFire.menu.USB.z_custom.build.extra_flags=

chipkit_Pi.menu.USB.z_custom=Custom / Disabled
chipkit_Pi.menu.USB.z_custom.build.extra_flags=
chipkit_Pi.menu.USB.a_cdcacm=Serial
chipkit_Pi.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
chipkit_Pi.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
chipkit_Pi.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

ck-pro-mz.menu.USB.a_cdcacm=Serial
ck-pro-mz.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
ck-pro-mz.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
ck-pro-mz.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
ck-pro-mz.menu.USB.z_custom=Custom / Disabled
ck-pro-mz.menu.USB.z_custom.build.extra_flags=

mega_pic32.menu.USB.z_custom=Custom / Disabled
mega_pic32.menu.USB.z_custom.build.extra_flags=
mega_pic32.menu.USB.a_cdcacm=Serial
mega_pic32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
mega_pic32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
mega_pic32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__

flipnclickmz.menu.USB.a_cdcacm=Serial
flipnclickmz.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
flipnclickmz.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
flipnclickmz.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
flipnclickmz.menu.USB.z_custom=Custom / Disabled
flipnclickmz.menu.USB.z_custom.build.extra_flags=

lenny.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
lenny.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
lenny.menu.USB.a_cdcacm=Serial
lenny.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
lenny.menu.USB.z_custom=Custom / Disabled
lenny.menu.USB.z_custom.build.extra_flags=

fubarino_sd.menu.USB.a_cdcacm=Serial
fubarino_sd.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
fubarino_sd.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
fubarino_sd.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
fubarino_sd.menu.USB.z_custom=Custom / Disabled
fubarino_sd.menu.USB.z_custom.build.extra_flags=

fubarino_mini_20.menu.USB.a_cdcacm=Serial
fubarino_mini_20.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
fubarino_mini_20.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
fubarino_mini_20.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
fubarino_mini_20.menu.USB.z_custom=Custom / Disabled
fubarino_mini_20.menu.USB.z_custom.build.extra_flags=

quick240_usb_pic32.menu.USB.a_cdcacm=Serial
quick240_usb_pic32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
quick240_usb_pic32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
quick240_usb_pic32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
quick240_usb_pic32.menu.USB.z_custom=Custom / Disabled
quick240_usb_pic32.menu.USB.z_custom.build.extra_flags=

fubarino_mini.menu.USB.a_cdcacm=Serial
fubarino_mini.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
fubarino_mini.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
fubarino_mini.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
fubarino_mini.menu.USB.z_custom=Custom / Disabled
fubarino_mini.menu.USB.z_custom.build.extra_flags=

Olimex_Pinguino32.menu.USB.a_cdcacm=Serial
Olimex_Pinguino32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
Olimex_Pinguino32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
Olimex_Pinguino32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
Olimex_Pinguino32.menu.USB.z_custom=Custom / Disabled
Olimex_Pinguino32.menu.USB.z_custom.build.extra_flags=

chipkit_DP32.menu.USB.a_cdcacm=Serial
chipkit_DP32.menu.USB.a_cdcacm.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM__ -D__SERIAL_IS_USB__
chipkit_DP32.menu.USB.b_cdcacm_km=Serial, Keyboard & Mouse
chipkit_DP32.menu.USB.b_cdcacm_km.build.extra_flags=-D__USB_ENABLED__ -D__USB_CDCACM_KM__ -D__SERIAL_IS_USB__
chipkit_DP32.menu.USB.z_custom=Custom / Disabled
chipkit_DP32.menu.USB.z_custom.build.extra_flags=

